#ifndef  _rus_lcd_INCLUDED_
#define _rus_lcd_INCLUDED_ 
/*  ТАБЛИЦА СООТВЕТСТВИЯ
Число	Символ	Число	Символ	Число	Символ	Число	Символ	ЧислоСимвол
33	!	34	"	35	#	36	$	37	%
38	&	39	'	40	(	41	)	42	*
43	+	44	,	45	-	46	.	47	/
48	0	49	1	50	2	51	3	52	4
53	5	54	6	55	7	56	8	57	9
58	:	59	;	60	<	61	=	62	>
63	?	64	@	65	A	66	B	67	C
68	D	69	E	70	F	71	G	72	H
73	I	74	J	75	K	76	L	77	M
78	N	79	O	80	P	81	Q	82	R
83	S	84	T	85	U	86	V	87	W
88	X	89	Y	90	Z	91	[	92	\
93	]	94	^	95	_	96	`	97	a
98	b	99	c	100	d	101	e	102	f
103	g	104	h	105	I	106	j	107	k
108	l	109	m	110	n	111	o	112	p
113	q	114	r	115	s	116	t	117	u
118	v	119	w	120	x	121	y	122	z
123	{	124	|	125	}	126	~	132	"
133	…	145	'	146	'	147	"	148	"
149	o	150	-	151	-	153	™	166	¦
167	§	168	Ё	169	©	171	"	172	   
174	®	176	°	177	±	178	І	179	і
182		183	·	184	ё	185	№	187	"
192	А	193	Б	194	В	195	Г	196	Д
197	Е	198	Ж	199	З	200	И	201	Й
202	К	203	Л	204	М	205	Н	206	О
207	П	208	Р	209	С	210	Т	211	У
212	Ф	213	Х	214	Ц	215	Ч	216	Ш
217	Щ	218	Ъ	219	Ы	220	Ь	221	Э
222	Ю	223	Я	224	а	225	б	226	в
227	г	228	д	229	е	230	ж	231	з
232	и	233	й	234	к	235	л	236	м
237	н	238	о	239	п	240	р	241	с
242	т	243	у	244	ф	245	х	246	ц
247	ч	248	ш	249	щ	250	ъ	251	ы
252	ь	253	э	254	ю	255	я	-	-
*/
const unsigned char rus_buff[]={                             // код буквы 
0xFD,0xa2,255 ,                                     //167-169
170 ,0xc8,172 ,173 ,174 ,175 ,176 ,177 ,0xd7,0x69,  //170-179
180 ,181 ,0xfe,0xdf,0xb5,0xcc,186 ,0xc9,188 ,189 ,  //180-189
190 ,191 ,0x41,0xa0,0x42,0xa1,0xe0,0x45,0xa3,0xa4,  //190-199
0xa5,0xa6,0x4b,0xa7,0x4d,0x48,0x4f,0xa8,0x50,0x43,  //200-209
0x54,0xa9,0xaa,0x58,0xe1,0xab,0xac,0xe2,0xad,0xae,  //210-219
0xc4,0xaf,0xb0,0xb1,0x61,0xb2,0xb3,0xb4,0xe3,0x65,  //220-229
0xb6,0xb7,0xb8,0xb9,0xba,0xbb,0xbc,0xbd,0x6f,0xbe,  //230-239
0x70,0x63,0xbf,0x79,0xaa,0x78,0xe5,0xc0,0xc1,0xe6,  //240-249
0xc2,0xc3,0xc4,0xc5,0xc6,0xc7};                     //250-255
//преобразование массива начинается с 167 символа
//десятичные цифры в буфере-это те символы, которые невозможно отображать на ЖКИ. 
//Их можно назначить по своему усмотрению.
//Например, сейчас (см выше) набрав на клавиатуре @ (код 169) на ЖКИ будет отображаться 
//чёрное знакоместо (код 0хFF (255десятичн.) )
/*
@- 0хFF

*/
void ruslcd (unsigned char *buff){
unsigned char i;
i=0;
while ( buff[i]!=0 ) {
	if(buff[i]>166) buff[i]=rus_buff[buff[i]-167];
	i=i+1;}
}  
#endif

/*----------------------------------------------------------------------------
 * end of file
 *---------------------------------------------------------------------------*/
